Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/Microchip.PIC32MK-MC_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.ATMEL.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>PIC32MK-MC_DFP</name>
   <description>Microchip PIC32MK-MC Series Device Support</description>
   <releases>
      <release version="1.10.146" date="2022-02-17">
        - Added PIC32MK0128MCA0[28|32|48] parts.
      </release>
      <release version="1.9.143" date="2021-09-01">Correction to peripherals xml description enables watching them in I/O view.</release>
      <release version="1.8.132" date="2021-03-04">Added interrupt offset registers OFF238-OFF243 for PIC32MK-MCM devices. Added trigger sources AN20-AN23 for PIC32MK-MCM100 devices. Added PWM channel 10-12 for 64 pin MCM parts for MPLAB Harmony.</release>
      <release version="1.7.128" date="2021-02-24">Added PWM channel 10-12 for 64 pin MCM parts.</release>
      <release version="1.6.125" date="2021-01-26">Updated deep sleep module.</release>
      <release version="1.5.115" date="2020-08-19">Updated clause 2 of the license text in headers, linker scripts and .S files to no require publication of copyright notice in embedded applications. Split RCON module. Updated CLC input names.</release>
      <release version="1.4.94" date="2020-04-29">Updated XC32 startup code.</release>
      <release version="1.3.91" date="2020-02-12">Updated device id information for MPLAB X.</release>
      <release version="1.2.80" date="2019-10-15">Removed PWM1nIF from IFSn. Updated VirtualPin description. Added HYSPOL bit to CMnCON. Removed PWMCON10.</release>
      <release version="1.1.53" date="2019-07-11">Added PIC32MK-MCJ devices. Updated name of ANO pin to AN0 for PIC32MK0512MCF064, PIC32MK0512MCM064, PIC32MK1024MCF064, and PIC32MK1024MCM064.</release>
      <release version="1.0.38" date="2019-04-16">Fixed GPIO port definitions, POSCGain and POSCFGain bit field definition, Excluded Interrupt Offset registers OFF126-129, OFF139-147, OFF151-153 on 64 pin variants.</release>
      <release version="1.0.22" date="2019-01-24">Initial release.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>PIC32MK-MC</keyword>
   </keywords>
   <devices>
      <family Dfamily="PIC32MK-MC" Dvendor="Microchip:3">
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                            schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
               <mchp:prerequisite component="MPLAB X IPE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="PIC32MK0128MCA028">
            <processor Dcore="32xxxx"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="SP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MK0128MCA028.atdf"/>
                  <at:variant ordercode=""
                              vccmin="2.3"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory exec=""
                             name="emulation"
                             rw=""
                             size="0x100000"
                             start="0xff300000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="devid"
                             rw=""
                             size="0x0"
                             start="0xffffffff"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="code"
                             rw=""
                             size="0x20000"
                             start="0x1d000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="testmem"
                             rw=""
                             size="0x1000"
                             start="0x1fc42000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootalias"
                             rw=""
                             size="0x3f30"
                             start="0x1fc00000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliaslastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc04000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1"
                             rw=""
                             size="0x3f30"
                             start="0x1fc40000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1lastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc44000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliasaltconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc03f30"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="altboot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43f30"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="kseg0_data_mem"
                             rw=""
                             size="0x8000"
                             start="0x00000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_std"
                             rw=""
                             size="0x2000"
                             start="0x1f800000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_fast"
                             rw=""
                             size="0x2000"
                             start="0x1f810000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb2_std"
                             rw=""
                             size="0xe200"
                             start="0x1f820000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb4_std"
                             rw=""
                             size="0x700"
                             start="0x1f860000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb5_std"
                             rw=""
                             size="0xb000"
                             start="0x1f880000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb6_std"
                             rw=""
                             size="0x400"
                             start="0x1f8c0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_ssx"
                             rw=""
                             size="0x10000"
                             start="0x1f8f0000"
                             type=""
                             address-space="base"/>
                  <at:interface type="jtag" name="JTAG"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MK0128MCA028.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MK0128MCA028"
                  title="Device page for PIC32MK0128MCA028"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MK0128MCA028"
                  title="Datasheet"/>
         </device>
         <device Dname="PIC32MK0128MCA032">
            <processor Dcore="32xxxx"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="SP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MK0128MCA032.atdf"/>
                  <at:variant ordercode=""
                              vccmin="2.3"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory exec=""
                             name="emulation"
                             rw=""
                             size="0x100000"
                             start="0xff300000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="devid"
                             rw=""
                             size="0x0"
                             start="0xffffffff"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="code"
                             rw=""
                             size="0x20000"
                             start="0x1d000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="testmem"
                             rw=""
                             size="0x1000"
                             start="0x1fc42000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootalias"
                             rw=""
                             size="0x3f30"
                             start="0x1fc00000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliaslastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc04000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1"
                             rw=""
                             size="0x3f30"
                             start="0x1fc40000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1lastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc44000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliasaltconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc03f30"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="altboot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43f30"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="kseg0_data_mem"
                             rw=""
                             size="0x8000"
                             start="0x00000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_std"
                             rw=""
                             size="0x2000"
                             start="0x1f800000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_fast"
                             rw=""
                             size="0x2000"
                             start="0x1f810000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb2_std"
                             rw=""
                             size="0xe200"
                             start="0x1f820000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb4_std"
                             rw=""
                             size="0x700"
                             start="0x1f860000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb5_std"
                             rw=""
                             size="0xb000"
                             start="0x1f880000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb6_std"
                             rw=""
                             size="0x400"
                             start="0x1f8c0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_ssx"
                             rw=""
                             size="0x10000"
                             start="0x1f8f0000"
                             type=""
                             address-space="base"/>
                  <at:interface type="jtag" name="JTAG"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MK0128MCA032.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MK0128MCA032"
                  title="Device page for PIC32MK0128MCA032"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MK0128MCA032"
                  title="Datasheet"/>
         </device>
