Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/Microchip.PIC32MK-MC_DFP.pdsc
         <device Dname="PIC32MK0512MCJ048">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MK0512MCJ048.atdf"/>
                  <at:variant ordercode=""
                              vccmin="2.3"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode=""
                              vccmin="2.3"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory exec=""
                             name="lowerbootaliasaltconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc03f30"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="altboot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43f30"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootalias"
                             rw=""
                             size="0x3f30"
                             start="0x1fc00000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliaslastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc04000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1page0"
                             rw=""
                             size="0x1000"
                             start="0x1fc40000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1page1"
                             rw=""
                             size="0x1000"
                             start="0x1fc41000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1page3"
                             rw=""
                             size="0xf30"
                             start="0x1fc43000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1lastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc44000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="code"
                             rw=""
                             size="0x80000"
                             start="0x1d000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliasconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc03fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="adccal"
                             rw=""
                             size="0x1c"
                             start="0x1fc45000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="serial"
                             rw=""
                             size="0x10"
                             start="0x1fc45020"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="eedatacal"
                             rw=""
                             size="0x10"
                             start="0x1fc45030"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="devid"
                             rw=""
                             size="0x0"
                             start="0xffffffff"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="emulation"
                             rw=""
                             size="0x100000"
                             start="0xff300000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="kseg0_data_mem"
                             rw=""
                             size="0x10000"
                             start="0x00000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_std"
                             rw=""
                             size="0x2000"
                             start="0x1f800000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_fast"
                             rw=""
                             size="0x2000"
                             start="0x1f810000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb2_std"
                             rw=""
                             size="0xe200"
                             start="0x1f820000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb3_std"
                             rw=""
                             size="0xc800"
                             start="0x1f840000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb4_std"
                             rw=""
                             size="0x700"
                             start="0x1f860000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb5_std"
                             rw=""
                             size="0xb000"
                             start="0x1f880000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb6_std"
                             rw=""
                             size="0x400"
                             start="0x1f8c0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_ssx"
                             rw=""
                             size="0x10000"
                             start="0x1f8f0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="testmem"
                             rw=""
                             size="0x1000"
                             start="0x1fc42000"
                             type=""
                             address-space="base"/>
                  <at:interface type="jtag" name="JTAG"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MK0512MCJ048.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MK0512MCJ048"
                  title="Device page for PIC32MK0512MCJ048"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MK0512MCJ048"
                  title="Datasheet"/>
         </device>
         <device Dname="PIC32MK0512MCJ064">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MK0512MCJ064.atdf"/>
                  <at:variant ordercode=""
                              vccmin="2.3"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode=""
                              vccmin="2.3"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory exec=""
                             name="lowerbootaliasaltconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc03f30"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="altboot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43f30"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootalias"
                             rw=""
                             size="0x3f30"
                             start="0x1fc00000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliaslastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc04000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1page0"
                             rw=""
                             size="0x1000"
                             start="0x1fc40000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1page1"
                             rw=""
                             size="0x1000"
                             start="0x1fc41000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1page3"
                             rw=""
                             size="0xf30"
                             start="0x1fc43000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1lastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc44000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="code"
                             rw=""
                             size="0x80000"
                             start="0x1d000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliasconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc03fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="adccal"
                             rw=""
                             size="0x1c"
                             start="0x1fc45000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="serial"
                             rw=""
                             size="0x10"
                             start="0x1fc45020"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="eedatacal"
                             rw=""
                             size="0x10"
                             start="0x1fc45030"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="devid"
                             rw=""
                             size="0x0"
                             start="0xffffffff"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="emulation"
                             rw=""
                             size="0x100000"
                             start="0xff300000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="kseg0_data_mem"
                             rw=""
                             size="0x10000"
                             start="0x00000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_std"
                             rw=""
                             size="0x2000"
                             start="0x1f800000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_fast"
                             rw=""
                             size="0x2000"
                             start="0x1f810000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb2_std"
                             rw=""
                             size="0xe200"
                             start="0x1f820000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb3_std"
                             rw=""
                             size="0xc800"
                             start="0x1f840000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb4_std"
                             rw=""
                             size="0x700"
                             start="0x1f860000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb5_std"
                             rw=""
                             size="0xb000"
                             start="0x1f880000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb6_std"
                             rw=""
                             size="0x400"
                             start="0x1f8c0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_ssx"
                             rw=""
                             size="0x10000"
                             start="0x1f8f0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="testmem"
                             rw=""
                             size="0x1000"
                             start="0x1fc42000"
                             type=""
                             address-space="base"/>
                  <at:interface type="jtag" name="JTAG"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MK0512MCJ064.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MK0512MCJ064"
                  title="Device page for PIC32MK0512MCJ064"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MK0512MCJ064"
                  title="Datasheet"/>
         </device>
